CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_rcc.h
/**
 * @file cw32l052_rcc.h
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-02-23
 *
 * @copyright Copyright (c) 2022
 *
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L052_RCC_H
#define __CW32L052_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "cw32l052.h"
#include "base_types.h"

//==================================================================================
#define HSIOSC_VALUE                               ((uint32_t)48000000)                 /*!< Value of the Internal oscillator in Hz*/
#define HSE_VALUE                                  ((uint32_t)16000000)                 /*!< Value of the External oscillator in Hz */

#define LSI_VALUE                                  ((uint32_t)32800)                    /*!< Value of the External oscillator in Hz */
#define LSE_VALUE                                  ((uint32_t)32768)                    /*!< Value of the External oscillator in Hz */
/* SYSCTRL CR0 --------------------------------------------------------*/
#define SYSCTRL_BYPASS                             (0x5A5A0000U)
#define SYSCTRL_BYPASS_MASK                        (0xFFFF0000U)

#define RCC_HCLK_DIV1                              (0x0UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK not divided */
#define RCC_HCLK_DIV2                              (0x1UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 2 */
#define RCC_HCLK_DIV4                              (0x2UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 4 */
#define RCC_HCLK_DIV8                              (0x3UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 8 */
#define RCC_HCLK_DIV16                             (0x4UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 16 */
#define RCC_HCLK_DIV32                             (0x5UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 32 */
#define RCC_HCLK_DIV64                             (0x6UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 64 */
#define RCC_HCLK_DIV128                            (0x7ul << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 128 */
#define IS_RCC_HCLKPRS(INSTANCE)                   (((INSTANCE) == RCC_HCLK_DIV1)              ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV2)               ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV4)               ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV8)               ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV16)              ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV32)              ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV64)              ||\
                                                   ((INSTANCE) == RCC_HCLK_DIV128))

#define RCC_PCLK_DIV1                              (0x0UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK not divided */
#define RCC_PCLK_DIV2                              (0x1UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 2 */
#define RCC_PCLK_DIV4                              (0x2UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 4 */
#define RCC_PCLK_DIV8                              (0x3UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 8 */
#define IS_RCC_PCLKPRS(INSTANCE)                   (((INSTANCE) == RCC_PCLK_DIV1)              ||\
                                                   ((INSTANCE) == RCC_PCLK_DIV2)               ||\
                                                   ((INSTANCE) == RCC_PCLK_DIV4)               ||\
                                                   ((INSTANCE) == RCC_PCLK_DIV8))

#define RCC_SYSCLKSRC_HSI                          (0x00000000U)                        /*!< HSI selected as system clock */
#define RCC_SYSCLKSRC_HSE                          (0x00000001U)                        /*!< HSE selected as system clock */
#define RCC_SYSCLKSRC_LSI                          (0x00000003U)                        /*!< LSI selected as system clock */
#define RCC_SYSCLKSRC_LSE                          (0x00000004U)                        /*!< LSE selected as system clock */
#define IS_RCC_SYSCLKSRC(INSTANCE)                 (((INSTANCE) == RCC_SYSCLKSRC_HSI)          ||\
                                                   ((INSTANCE) == RCC_SYSCLKSRC_HSE)           ||\
                                                   ((INSTANCE) == RCC_SYSCLKSRC_LSI)           ||\
                                                   ((INSTANCE) == RCC_SYSCLKSRC_LSE))

/* SYSCTRL CR1 --------------------------------------------------------*/
#define RCC_SYSCTRL_HSIEN                          bv0
#define RCC_SYSCTRL_HSEEN                          bv1
#define RCC_SYSCTRL_LSIEN                          bv3
#define RCC_SYSCTRL_LSEEN                          bv4
#define RCC_SYSCTRL_LSELOCKEN                      bv5
#define RCC_SYSCTRL_LSELOCKDIS                     0x00UL
#define IS_RCC_LSELOCK_STATUS(INSTANCE)            (((INSTANCE) == RCC_SYSCTRL_LSELOCKEN)          ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_LSELOCKDIS))

#define RCC_SYSCTRL_LSECCS                         bv6
#define RCC_SYSCTRL_HSECCS                         bv7
#define RCC_SYSCTRL_CLKCCS                         bv8
#define IS_RCC_CCS_STATUS(INSTANCE)                (((INSTANCE) == RCC_SYSCTRL_LSECCS)           ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_HSECCS)           ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_CLKCCS))

/* SYSCTRL CR2 --------------------------------------------------------*/
#define RCC_SYSCTRL_SWDIOEN                        0x00UL
#define RCC_SYSCTRL_SWDIODIS                       bv1
#define IS_RCC_SWDIO_STATUS(INSTANCE)              (((INSTANCE) == RCC_SYSCTRL_SWDIOEN)          ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_SWDIODIS))

#define RCC_SYSCTRL_LOCKUPEN                       bv2
#define RCC_SYSCTRL_LOCKUPDIS                      0x00UL
#define IS_RCC_LOCKUP_STATUS(INSTANCE)             (((INSTANCE) == RCC_SYSCTRL_LOCKUPEN)          ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_LOCKUPDIS))

#define RCC_SYSCTRL_WAKEUPCLKEN                    bv3
#define RCC_SYSCTRL_WAKEUPCLKDIS                   0x00UL
#define IS_RCC_WAKEUPCLK_STATUS(INSTANCE)          (((INSTANCE) == RCC_SYSCTRL_WAKEUPCLKEN)          ||\
                                                   ((INSTANCE) == RCC_SYSCTRL_WAKEUPCLKDIS))
/* SYSCTRL HSI --------------------------------------------------------*/
#define RCC_HSI_TRIMCODEADDR                       (0x00100A00U)   //


