CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_rcc.h
#define __RCC_AUTOTRIM_CLK_ENABLE()                REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_AUTOTRIM)
#define __RCC_BTIM_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_BTIM)
#define __RCC_GTIM4_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_GTIM4)
#define __RCC_GTIM3_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_GTIM3)
#define __RCC_UART1_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_UART1)
#define __RCC_SPI1_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_SPI1)
#define __RCC_ATIM_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ATIM)
#define __RCC_VC_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_VC)
#define __RCC_ADC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ADC)
#define __RCC_UART6_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_UART6)


#define __RCC_AUTOTRIM_CLK_DISABLE()               (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_AUTOTRIM))
#define __RCC_BTIM_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_BTIM))
#define __RCC_GTIM4_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_GTIM4))
#define __RCC_GTIM3_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_GTIM3))
#define __RCC_UART1_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_UART1))
#define __RCC_SPI1_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_SPI1))
#define __RCC_ATIM_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ATIM))
#define __RCC_VC_CLK_DISABLE()                     (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_VC))
#define __RCC_ADC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ADC))
#define __RCC_UART6_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_UART6))

#define RCC_MCO_DIV1                               (0x00U)
#define RCC_MCO_DIV2                               ((uint8_t)(0x01U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV8                               ((uint8_t)(0x02U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV64                              ((uint8_t)(0x03U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV128                             ((uint8_t)(0x04U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV256                             ((uint8_t)(0x05U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV512                             ((uint8_t)(0x06U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV1024                            ((uint8_t)(0x07U << SYSCTRL_MCO_DIV_Pos))

#define IS_RCC_MCO_DIV(INSTANCE)                   (((INSTANCE) == RCC_MCO_DIV1)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV2)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV8)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV64)         ||\
                                                   ((INSTANCE) == RCC_MCO_DIV128)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV256)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV512)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV1024))

#define RCC_MCO_SRC_NONE                           (0x00U)
#define RCC_MCO_SRC_HCLK                           (0x01U)
#define RCC_MCO_SRC_PCLK                           (0x02U)
#define RCC_MCO_SRC_HSI                            (0x03U)
#define RCC_MCO_SRC_LSI                            (0x04U)
#define RCC_MCO_SRC_HSE                            (0x05U)
#define RCC_MCO_SRC_LSE                            (0x06U)
#define RCC_MCO_SRC_RC150K                         (0x08U)
#define RCC_MCO_SRC_RC10K                          (0x09U)

#define IS_RCC_MCO_SRC(INSTANCE)                   (((INSTANCE) == RCC_MCO_SRC_NONE)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HCLK)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_PCLK)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HSI)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_LSI)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HSE)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_LSE)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_RC150K)     || \
                                                   ((INSTANCE) == RCC_MCO_SRC_RC10K))

#define RCC_TIMITR_BTIM1                           (0UL)
#define RCC_TIMITR_BTIM2                           (1UL)
#define RCC_TIMITR_BTIM3                           (2UL)
#define RCC_TIMITR_GTIM1                           (3UL)
#define RCC_TIMITR_GTIM2                           (4UL)
#define RCC_TIMITR_GTIM3                           (5UL)
#define RCC_TIMITR_GTIM4                           (6UL)
#define RCC_TIMITR_ATIM                            (7UL)

#define IS_RCC_TIMITR_SOURCE(SRC)                  ((SRC) < 8)


//==================================================================================
extern void RCC_HCLKPRS_Config(uint32_t HCLKPRS);
extern void RCC_PCLKPRS_Config(uint32_t PCLKPRS);
extern void RCC_SYSCLKSRC_Config(uint32_t SYSCLKSRC);
extern void RCC_CCS_Config(uint32_t CCS, FunctionalState NewState);
extern void RCC_LSELOCK_Config(uint32_t LSELOCK);
extern void RCC_WAKEUPCLK_Config(uint32_t WAKEUPCLK);
extern void RCC_LOCKUP_Config(uint32_t LOCKUP);
extern void RCC_SWDIO_Config(uint32_t SWDIO);
extern int RCC_DeInit(void);
extern void RCC_SystemCoreClockUpdate(uint32_t NewFreq);
extern int RCC_HSI_Enable(uint32_t HSIDiv);
extern void RCC_HSI_Disable(void);
extern int RCC_LSI_Enable(void);
extern void RCC_LSI_Disable(void);
extern int RCC_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt);
extern void RCC_HSE_Disable(void);
extern int RCC_LSE_Enable(uint32_t Mode, uint8_t Amp, uint8_t Driver);
extern void RCC_LSE_Disable(void);
extern uint8_t RCC_SysClk_Switch(uint32_t NewClk);
extern void RCC_ITConfig(uint32_t RCC_IT, FunctionalState NewState);
extern ITStatus RCC_GetITStatus(uint32_t RCC_IT);
extern void RCC_ClearITPendingBit(uint32_t RCC_IT);
extern FlagStatus RCC_GetStableFlag(uint32_t RCC_STABLEFLAG);
extern uint32_t RCC_GetAllStableFlag(void);
extern void RCC_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState);
extern void RCC_AHBPeriphReset(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphReset1(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphReset2(uint32_t Periph, FunctionalState NewState);
extern FlagStatus RCC_GetRstFlag(uint32_t RCC_RSTFLAG);
extern uint32_t RCC_GetAllRstFlag(void);
extern void RCC_ClearRstFlag(uint32_t RCC_RSTFLAG);
extern void RCC_HCLK_OUT(void);
extern void RCC_PCLK_OUT(void);
extern void RCC_HSE_OUT(void);
extern void RCC_HSI_OUT(void);
extern void RCC_LSE_OUT(void);
extern void RCC_LSI_OUT(void);
extern void RCC_MCO_OUT(uint8_t Source, uint8_t Div);

extern uint32_t RCC_Sysctrl_GetHClkFreq(void);
extern uint32_t RCC_Sysctrl_GetPClkFreq(void);

void RCC_BTIM3ITRSelect(uint32_t Source);
void RCC_BTIM2ITRSelect(uint32_t Source);
void RCC_BTIM1ITRSelect(uint32_t Source);
void RCC_GTIM1ITRSelect(uint32_t Source);
void RCC_GTIM2ITRSelect(uint32_t Source);
void RCC_GTIM3ITRSelect(uint32_t Source);
void RCC_GTIM4ITRSelect(uint32_t Source);
void RCC_ATIMITRSelect(uint32_t Source);


#ifdef __cplusplus
}
#endif

#endif /* __CW32L052_RCC_H */
